{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "93"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "93"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/embedding/NotEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/ones_like/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/lstm_model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "93"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "94"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_203", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_204", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_205", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_195", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_133", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_134", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_135", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_125", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_63", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_64", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_65", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_55", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_53", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_123", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_193", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/lstm_model/embedding/NotEqual", "op": "NotEqual", "input": ["input_1", "StatefulPartitionedCall/lstm_model/embedding/NotEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/lstm_model/embedding/Cast", "op": "Cast", "input": ["input_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/merge/_216", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_203", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/next_iteration/_258"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/merge/_217", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_204", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/next_iteration/_259"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/merge/_218", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_205", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/next_iteration/_260"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/merge/_208", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_195", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/next_iteration/_250"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/merge/_146", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_133", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/next_iteration/_188"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/merge/_147", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_134", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/next_iteration/_189"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/merge/_148", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_135", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/next_iteration/_190"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/merge/_138", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_125", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/next_iteration/_180"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_76", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_63", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_118"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_77", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_64", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_119"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_78", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_65", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_120"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_68", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_55", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_110"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_66", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_53", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_108"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/merge/_136", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_123", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/next_iteration/_178"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/merge/_206", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_193", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/next_iteration/_248"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/lstm_model/embedding/NotEqual", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/ExpandDims/dim"], "attr": {"T": {"type": "DT_BOOL"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/lstm_model/embedding/NotEqual", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/ExpandDims/dim"], "attr": {"T": {"type": "DT_BOOL"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/lstm_model/embedding/NotEqual", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/lstm_model/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/lstm_model/embedding/Cast", "StatefulPartitionedCall/lstm_model/embedding/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/ExpandDims", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/ExpandDims", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_BOOL"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/ExpandDims", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/lstm_model/embedding/embedding_lookup"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/ones_like/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/lstm_model/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/transpose_1", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/transpose_1", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_BOOL"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/lstm_model/lstm/Shape", "StatefulPartitionedCall/lstm_model/lstm/strided_slice/stack", "StatefulPartitionedCall/lstm_model/lstm/strided_slice/stack_1", "StatefulPartitionedCall/lstm_model/lstm/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/ones_like", "op": "Fill", "input": ["StatefulPartitionedCall/lstm_model/lstm/ones_like/Shape", "StatefulPartitionedCall/lstm_model/lstm/ones_like/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_202", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_132", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_62", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/lstm_model/lstm/strided_slice", "StatefulPartitionedCall/lstm_model/lstm/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/lstm_model/lstm/strided_slice", "StatefulPartitionedCall/lstm_model/lstm/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/lstm_model/embedding/embedding_lookup", "StatefulPartitionedCall/lstm_model/lstm/ones_like"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/merge/_215", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/enter/_202", "StatefulPartitionedCall/lstm_model/lstm_2/PartitionedCall/while/next_iteration/_257"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/merge/_145", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/enter/_132", "StatefulPartitionedCall/lstm_model/lstm_1/PartitionedCall/while/next_iteration/_187"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_75", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_62", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_117"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/lstm_model/lstm/zeros_1/packed", "StatefulPartitionedCall/lstm_model/lstm/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/lstm_model/lstm/zeros/packed", "StatefulPartitionedCall/lstm_model/lstm/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/lstm_model/lstm/mul", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_59", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_58", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/zeros"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/lstm_model/lstm/zeros", "StatefulPartitionedCall/lstm_model/lstm/Read_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_72", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_59", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_114"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_71", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_58", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_113"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_61", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/lstm_model/lstm/Read/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_74", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_61", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_116"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/MatMul", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_60", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/add", "StatefulPartitionedCall/lstm_model/lstm/Read_2/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_56", "op": "Enter", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbHN0bV9tb2RlbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_73", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_60", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_115"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/split", "op": "Split", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/split/split_dim", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_69", "op": "Merge", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/enter/_56", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/next_iteration/_111"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/cond/_51/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_68", "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_73", "^StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/while/merge/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/lstm_model/lstm/PartitionedCall/Sigmoid_1", "op": 